package org.zyd.common.constants;

/**
 * 
 * 行业
 *
 */
public enum Industry {
	A0400010("无"),
	A0400020("彩绘"),
	A0400030("彩陶"),
	A0400040("雕塑"),
	A0400050("堆花"),
	A0400060("堆绘"),
	A0400070("精陶"),
	A0400080("均陶"),
	A0400090("美陶"),
	A0400100("泥绘"),
	A0400110("青瓷"),
	A0400120("陶刻"),
	A0400130("陶塑"),
	A0400140("陶艺"),
	A0400150("制罐"),
	A0400160("制壶"),
	A0400170("制盆"),
	A0400180("制瓶"),
	A0400190("装饰"),
	A0400200("紫砂"),
	A0400210("制笔筒"),
	A0400220("堆花工艺"),
	A0400230("均陶工艺"),
	A0400240("陶瓷镶嵌"),
	A0400250("陶瓷装饰"),
	A0400260("造型设计"),
	A0400270("紫砂雕塑"),
	A0400280("工艺美术"),
	A0400290("均陶堆花");

	private String desc;

	public String getDesc() {
		return this.desc;
	}

	Industry(String desc) {
		this.desc = desc;
	}
}
